Show / Hide Table of Contents
Class GrpcReflectionMessageHandler
Handler that invokes methods for specified object over Grpc via reflection.
Inheritance
System.Object
GrpcReflectionMessageHandler
Implements
IGrpcMessageHandler<System.Object>
IGrpcMessageHandler
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc.Reflection
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class GrpcReflectionMessageHandler : IGrpcMessageHandler<object>, IGrpcMessageHandler
Constructors
Improve this Doc   View Source
GrpcReflectionMessageHandler(Object)
Initializes new GrpcReflectionMessageHandler
Declaration
public GrpcReflectionMessageHandler(object instance)
Parameters
 Type |  Name |  Description
 System.Object |  instance
Instance for which the messages will be handled.
Fields
Improve this Doc   View Source
GRPC_REFLECTION_HANDLER_MESSAGE
Declaration
public const string GRPC_REFLECTION_HANDLER_MESSAGE = "Grpc.Handlers.Reflection"
Field Value
 Type |  Description
 System.String
Methods
Improve this Doc   View Source
HandleClientMessage(GrpcMessage, GrpcClient)
Declaration
public Task<object> HandleClientMessage(GrpcMessage message, GrpcClient client)
Parameters
 Type |  Name |  Description
 GrpcMessage |  message
 GrpcClient |  client
Returns
 Type |  Description
 System.Threading.Tasks.Task<System.Object>
Improve this Doc   View Source
HandleServerMessage(GrpcMessage, GrpcServer)
Declaration
public Task<object> HandleServerMessage(GrpcMessage message, GrpcServer server)
Parameters
 Type |  Name |  Description
 GrpcMessage |  message
 GrpcServer |  server
Returns
 Type |  Description
 System.Threading.Tasks.Task<System.Object>
Implements
 IGrpcMessageHandler<T>
 IGrpcMessageHandler
 Improve this Doc
 View Source